acc1072.АвтоматизацияИнформированияДебиторов/src/Catalogs/КонтактныеЛица/КонтактныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e0e863f9-8c16-453e-b505-f9511b4e4e53">
  <name>КонтактныеЛица</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="71a9292b-de1d-4031-885c-2e4c37e8bbd4">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8ca88fe5-8e2c-4359-a5eb-402ef5adae4a">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7e254f08-d504-4ee1-ba4e-351e0243d7cd">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

acc1072.АвтоматизацияИнформированияДебиторов/src/InformationRegisters/Аид_КонтактныеЛицаКонтрагентов/Аид_КонтактныеЛицаКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аид_КонтактныеЛицаКонтрагентов</name>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

acc1072.АвтоматизацияИнформированияДебиторов/src/Catalogs/КонтактныеЛица/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура Аид_КонтактноеЛицоАИДВместо(Команда)
	ТекДанные = Элементы.Список.ТекущаяСтрока;
	Если ТекДанные = неопределено Тогда
		Возврат;
	КонецЕсли;
	Аид_КонтактноеЛицоАИДНаСервере(ТекДанные);
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере
Процедура Аид_КонтактноеЛицоАИДНаСервере(КонтактноеЛицо)
	ЗаписьКонтЛицоАИД = РегистрыСведений.Аид_КонтактныеЛицаКонтрагентов.СоздатьМенеджерЗаписи();
	ЗаписьКонтЛицоАИД.Контрагент = КонтактноеЛицо.ОбъектВладелец;
	ЗаписьКонтЛицоАИД.КонтактноеЛицо = КонтактноеЛицо;
	ЗаписьКонтЛицоАИД.Записать(Истина);
	Аид_УстановитьУсловноеОформление(КонтактноеЛицо.ОбъектВладелец);
КонецПроцедуры

Процедура Аид_УстановитьУсловноеОформление(Контрагент) Экспорт
	Список.УсловноеОформление.Элементы.Очистить();
	ЭлементУсловногоОформления = Список.УсловноеОформление.Элементы.Добавить();
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Аид_ПолучитьКонтактноеЛицоПартнера(Контрагент);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина,,,,));
КонецПроцедуры

Функция Аид_ПолучитьКонтактноеЛицоПартнера(Контрагент) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = "ВЫБРАТЬ
	|	Аид_КонтактныеЛицаКонтрагентов.КонтактноеЛицо КАК КонтактноеЛицо
	|ИЗ
	|	РегистрСведений.Аид_КонтактныеЛицаКонтрагентов КАК Аид_КонтактныеЛицаКонтрагентов
	|ГДЕ
	|	Аид_КонтактныеЛицаКонтрагентов.Контрагент = &Контрагент";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.КонтактноеЛицо;
	КонецЕсли;
	Возврат Справочники.КонтактныеЛица.ПустаяСсылка();
КонецФункции



&НаСервере
Процедура Аид_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Аид_УстановитьУсловноеОформление(Параметры.Отбор.ОбъектВладелец);

КонецПроцедуры
